vgmariucci/remote_gate_access_control_with_esp32/firmware/sdkconfig.defaults
# Checked into git. Everything reproducible lives here; sdkconfig itself
# is generated and gitignored.

CONFIG_IDF_TARGET="esp32s3"

# Watchdogs: a hung controller must reboot, not sit there with the relay
# in an unknown state.
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_INT_WDT=y

# Logging. Drop to WARN for release builds so that codes and ids cannot
# leak through a serial console someone left attached.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Partition layout with two OTA slots plus an encrypted NVS partition.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Flash size. The dual-OTA layout in partitions.csv needs 3.2 MB, so the
# 2 MB default cannot hold it. Must match the physical part.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Enable these only once the board is final: flash encryption is a
# one-way door on a production device.
# CONFIG_SECURE_FLASH_ENC_ENABLED=y
# CONFIG_SECURE_BOOT=y
# CONFIG_NVS_ENCRYPTION=y
# Append to firmware/sdkconfig.defaults, then `rm sdkconfig` and rebuild.
#
# The dev console reads from USB-Serial/JTAG, which is the port you
# flash and monitor through. Making it the primary console routes the
# REPL and the logs over that one cable.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# ESP-IDF's FreeRTOS tick rate definition
CONFIG_FREERTOS_HZ=1000# Append to firmware/sdkconfig.defaults if not already there, then
#   unset IDF_TARGET; rm -rf build sdkconfig; idf.py set-target esp32s3

# 1 ms tick. At the 100 Hz default, pdMS_TO_TICKS(5) is 0 and the
# keypad task's vTaskDelayUntil asserts on boot.
CONFIG_FREERTOS_HZ=1000

# The main task runs the whole loop, including SHA-256.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# The dev console reads from USB-Serial/JTAG.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
